In [1]:
import pandas as pd

In [2]:
authors = pd.DataFrame({'author_id':[1, 2, 3],
                        'author_name': ['Тургенев', 'Чехов', 'Островский']}, columns=['author_id', 'author_name'])
print(authors)

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [3]:
book = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3],
                    'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 
                                  'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
                    'price':[100, 200, 150, 300, 250, 100, 90]}, 
                    columns=['author_id', 'book_title', 'price'])
print(book)

   author_id            book_title  price
0          1           Отцы и дети    100
1          1                 Рудин    200
2          1     Дворянское гнездо    150
3          2      Толстый и тонкий    300
4          2       Дама с собачкой    250
5          3                 Гроза    100
6          3  Таланты и поклонники     90

In [4]:
authors_price = pd.merge(authors, book, on = 'author_id', how = 'right')
print(authors_price)

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    100
1          1    Тургенев                 Рудин    200
2          1    Тургенев     Дворянское гнездо    150
3          2       Чехов      Толстый и тонкий    300
4          2       Чехов       Дама с собачкой    250
5          3  Островский                 Гроза    100
6          3  Островский  Таланты и поклонники     90

In [5]:
top5 = authors_price.nlargest(5, 'price')
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    300
4          2       Чехов    Дама с собачкой    250
1          1    Тургенев              Рудин    200
2          1    Тургенев  Дворянское гнездо    150
0          1    Тургенев        Отцы и дети    100

In [6]:
min_price = authors_price.groupby('author_name').agg({'price':'min'})
min_price = min_price.reset_index()
min_price = min_price.rename(columns={'price':'min_price'})
min_price

  author_name  min_price
0  Островский         90
1    Тургенев        100
2       Чехов        250

In [7]:
max_price = authors_price.groupby('author_name').agg({'price':'max'})
max_price = max_price.reset_index()
max_price = max_price.rename(columns={'price':'max_price'})
max_price

  author_name  max_price
0  Островский        100
1    Тургенев        200
2       Чехов        300

In [8]:
authors_stat = pd.merge(min_price, max_price, on = 'author_name', how='right')
print(authors_stat)

  author_name  min_price  max_price
0  Островский         90        100
1    Тургенев        100        200
2       Чехов        250        300

In [9]:
mean_price = authors_price.groupby('author_name').agg({'price':'mean'})
mean_price = mean_price.reset_index()
mean_price = mean_price.rename(columns={'price':'mean_price'})
mean_price

  author_name  mean_price
0  Островский        95.0
1    Тургенев       150.0
2       Чехов       275.0

In [10]:
authors_stat = pd.merge(authors_stat, mean_price, on = 'author_name')
authors_stat

  author_name  min_price  max_price  mean_price
0  Островский         90        100        95.0
1    Тургенев        100        200       150.0
2       Чехов        250        300       275.0